szenergy/stm32_switch_table/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32c0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SW_AUTO_Pin GPIO_PIN_11
#define SW_AUTO_GPIO_Port GPIOC
#define IN_BRAKE_Pin GPIO_PIN_12
#define IN_BRAKE_GPIO_Port GPIOC
#define SW_HAZARD_Pin GPIO_PIN_13
#define SW_HAZARD_GPIO_Port GPIOC
#define SW_HEADLIGHT_Pin GPIO_PIN_0
#define SW_HEADLIGHT_GPIO_Port GPIOC
#define IN_SHELL_RELAY_Pin GPIO_PIN_1
#define IN_SHELL_RELAY_GPIO_Port GPIOC
#define SW_WIPER_Pin GPIO_PIN_6
#define SW_WIPER_GPIO_Port GPIOC
#define SW_MC_OW_Pin GPIO_PIN_7
#define SW_MC_OW_GPIO_Port GPIOC
#define SW_LIGHTS_Pin GPIO_PIN_8
#define SW_LIGHTS_GPIO_Port GPIOC
#define OUT_WIPER_CONVERTER_Pin GPIO_PIN_9
#define OUT_WIPER_CONVERTER_GPIO_Port GPIOC
#define OUT_BRAKE_Pin GPIO_PIN_2
#define OUT_BRAKE_GPIO_Port GPIOD

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
